Repository: RobotControlTechnologies/RCML_helpers
Catalog: configs/locale/rcml.po
Languages: ru

source: Too many registers used!
ru: Используется cлишком много регистров!

source: Add IID or remove "export" keyword.
ru: Добавьте IID или удалите ключевое слово "export".

source: Export keyword not allowed for non-lib program.
ru: Ключевое слово export разрешено только для программ из библиотек

source: Haven't robot: %s
ru: Нет робота: %s

source: Please restart compiler. Dont forget enable "%s" module in config.ini!
ru: ожалуйста перезапустите компилятор. Не забудьте включить "%s" модуль в config.ini!

source: Dublicate user robot function: %s
ru: Добликат пользовательской функции робота: %s

source: Use "IID" flag or remove "export" keyword.
ru: Используйте флаг "IID" или удалите ключевое слово "export".

source: Dublicate user function: %s
ru: Добликат пользовательской функции: %s

source: Line: %d. Undefined variable: %s
ru: Строка: %d. Переменная не определена: %s

source: Line: %d. Break operator outside loop!
ru: Строка: %d. Оператор break вне цикла!

source: Line: %d. Continue operator outside loop!
ru: Строка: %d. Оператор сontinue вне цикла!

source: Try: missing arguments!
ru: Try: недостаточно аргументов!

source: Try: muissing type argument!
ru: Try: не задан тип аргумента!

source: Try: unknow option name: %s
ru: Try: неизвестное имя свойства: %s

source: Try: invalid type!
ru: Try: неверный тип!

source: Try: invalid option argument!
ru: Try: неверный аргумент опции!

source: Variable cant have name as some robot!
ru: Имена переменной и робота не должны совпадать

source: Line: %d. Use robot vars into robot's function is prohibited!
ru: Строка: %d. Запрещено использовать переменные робота в функции робота!

source: Line: %d. Havent robot: %s
ru: Строка: %d. Нет робота: %s

source: Line: %d. Use robot names or robot vars into robot's function is prohibited!
ru: Строка: %d. Запрещено использовать имена или переменные роботов в функциях роботов!

source: Line: %d. Undefined robot variable: %s
ru: Строка: %d. Неопределенная переменная робота: %s

source: Call to function "main" is prohibited!
ru: Вызов функции "main" запрещен!

source: The call function with the package flag is prohibited!
ru: Запрещен вызов функции с флагом пакета!

source: Too many arguments for "input" function!
ru: Слишком много аргументов для функции "input"!

source: Missing arguments for "echo" function!
ru: Недостаточно аргументов для функции "echo"!

source: Invalid count arguments for "set" function!
ru: Задано неверное количество аргументов функции "set"!

source: Invalid wait flag parameter for "set" function!
ru: Неверно задан параметр флага ожидания ы функции "set"!

source: Unkcnow option name "%s" for "set" function!
ru: Неизвестное имя опции "%s" в функции"set"!

source: Invalid option argument for "set" function!
ru: Неверно задан параметр функции "set"

source: Invalid count arguments for "sleep" function!
ru: Задано еверное количество аргументов функции "sleep"

source: Invalid argument for "sleep" function!
ru: Неверно задан аргумент функции "sleep"!

source: Invalid count arguments for "hand_control" function!
ru: Задано неверное количество аргументов функции "hand_control"!

source: Invalid robot argument for "hand_control" function!
ru: Неверно задан аргумент робота в функции "hand_control"

source: Invalid control module argument for "hand_control" function!
ru: Неверно задан аргумент модуля контроя в функции "hand_control"

source: Havent control module: %s
ru: Нет модуля контроя: %s

source: Invalid argument by num %d for "hand_control" function!
ru: В функции "hand_control" неверно задан аргумент номер %d

source: Invalid count arguments for "send_package" function!
ru: Неверно задано количество аргументов в функции "send_package"

source: Invalid wait flag parameter for "send_package" function!
ru: Неверно задан параметр флага ожидания в функции "send_package"

source: Invalid name of function for system package: %s
ru: Задано неверное имя функции для системного пакета: %s

source: Warning: In line %d wait flag will be ignored by system function: %s!
ru: Предупреждение: В строке %d флаг ожидания не будет учитываться системоной функцией "%s"!

source: Function module "%s" havent function: %s
ru: В модуле функций "%s" нет функции: %s

source: Call to function "%s" of module "%s" have invalid list arguments!
ru: Вызов функции "%s" модуля "%s" содержит неверный список аргументов!

source: Unknow function module: %s
ru: Неизвестный модуль функций: %s

source: Line: %d. Lib "%s" not loaded!
ru: Строка: %d. Библиотека "%s" не загружена!

source: Line: %d. Lib "%s" havent function: %s
ru: Строка: %d. Библиотека "%s" не содержит функцию: %s

source: Line: %d. Call to function "%s" of lib "%s" have invalid list arguments!
ru: Строка: %d. Вызов функции "%s" библиотеки "%s" содержит неверный список аргументов!

source: Line: %d. Can't find for any robot for call the hand control function
ru: Строка: %d. Не могу найти робота для вызова функции ручного управления.

source: Line: %d. Can't find robot for execute the hand control function
ru: Строка: %d. Не могу найти робота для выполнения функции ручного управления.

source: Line: %d. Invalid axis name "%s" of control module
ru: Строка: %d. Неверно задано имя оси "%s" для модуля управления

source: Line: %d. Wrong number of arguments to function: %s
ru: Строка: %d. Задано неверное количество аргументов у функции: %s

source: Line: %d. Undefined function: %s
ru: Строка: %d. Неизвестная функция: %s

source: Line: %d. Wrong number of arguments for function: %s
ru: Строка: %d. Задано неверное количество аргументов у функции: %s

source: Line: %d. Call to function "%s" of lib have invalid list arguments!
ru: Строка: %d. Вызов функции "%s" библиотеки содержит неверный список аргументов!

source: Line: %d. Wrong list of arguments for function: %s
ru: Строка: %d. Задан неверный список аргументов в функции: %s

source: Line: %d. Can't find robot for execute function: %s
ru: Строка: %d. Не могу найти робота для выполнения функции: %s

source: Line: %d. Wrong number of arguments!
ru: Строка: %d. Неверное количество аргументов

source: Line: %d. Can't find robot function: %s
ru: Строка: %d. Не могу найти функцию робота: %s

source: Line: %d. Wrong list of arguments for call of function: %s!
ru: Строка: %d. Неверно задан список аргументов для вызова функции: %s

source: Used robot modules: %d
ru: Модулей робота используется: %d

source: Used function modules:
ru: Модулей функций используется:

source: Used control modules:
ru: Модулей управления используется:

source: Used libs: %d
ru: Используется библиотек: %d

source: func call %d:
ru: Вызов функции %d:

source: Line: %d. Dublicate RCML lib name: %s
ru: Строка: %d. Дублирование имени библиотеки RCML: %s

source: Line: %d. Syntax error in define!
ru: Строка: %d. Синтаксическая ошибка в операторе "define"!

source: Invalid param: %s
ru: Неверный параметр: %s

source: Example: [-debug] [-version] rcml_compiler test.rcml test.rcml.pc test.rcml.dbg
ru: Пример: [-debug] [-version] rcml_compiler test.rcml test.rcml.pc test.rcml.dbg

source: Example: [-version] rcml_compiler test.rcml test.rcml.pc
ru: Пример: [-version] rcml_compiler test.rcml test.rcml.pc

source: Invalid arguments!
ru: Неверные аргументы!

source: Cant find source file: %s
ru: Не могу найти исходный файл: %s

source: Source file is not file: %s
ru: Это не файл исходного кода: %s

source: Preprocessor parsing error(s):
ru: Ошибка парсинга препроцессора:

source: Parsing error(s):
ru: Ошибка парсинга:

source: Load libs error:
ru: Ошибка загрузки библиотеки:

source: Havent main function!
ru: Не задана функция "main"!

source: Processing error:
ru: Ошибка обработки:

source: Cant open out dump file: %s
ru: Не могу открыть dump файл: %s

source: Before process calls
ru: Перед вызовом обрабтки

source: Programm successful compiled!
ru: Программа успешно скомпилирована!

source: The error(s) occurred:
ru: Произошла ошибка(и):

source: locale setted incorrectly! Try to add .UTF-8 to locale
ru: Локаль установлена неверно!

source: Error in %s module %s:
ru: Ошибка в %s модуля %s:

source: Cant find lib search path: %s
ru: Не могу найти путь к библиотеке: %s

source: Lib search path is not directory: %s
ru: Путь к библиотеке " %s" не является директорией!

source: Before delete non reache code
ru: Перед удалением недостижимого кода

source: Don't know how to proceed O_O ...
ru: Не знаю как такое обработать O_O ...

source: Repository not enabled!
ru: Репозиторий не подключен!

source: Maybe this module just need enable in config file?
ru: Может быть этот модульнужно просто включить в файл конфигурации

source: Directory of %s module "%s" already exists!
ru: Директория %s модуля "%s" уже существует!

source: The "%s" function is not found into the existing modules. Try attempt to find module, that have this function? [y/n]:
ru: Функция "%s" не найдена в существующих модулях. Попробовать найти модуль, содержащий эту функцию? [y/n]:

source: The %s module is not found by IID: %s. Try attempt to find module into repository? [y/n]:
ru: Модуль %s не найден по IID: %s. Попробовать найти в репозитории? [y/n]:

source: Check %s module in repository by name: %s...
ru: Проверяю наличае модуля %s в репозитории, по имени: %s...

source: Check %s module in repository by function name: %s...
ru: Проверяю наличае модуля %s в репозитории, по имени функции: %s...

source: Check %s module in repository by IID: %s...
ru: Проверяю наличае модуля %s в репозитории, по IID: %s...

source: failed
ru: Неудача

source: Cant find %s module in repository!
ru: Не могу найти модуль "%s" в репозитории!

source: success
ru: успех

source: Finded only one %s module:
ru: Найден только один модуль %s:

source: Load this module? [y/n]:
ru: Загрузить этот модуль? [y/n]:

source: Finded next %s modules:
ru: Найдены модули %s:

source: Input number of module, that will be loaded (or zero for abort loading):
ru: Введите номер модуля, который хотите згрузить (0 для отмены загрузки):

source: The loading of module is aborted by user
ru: Загрузка модуля прервана пользователем

source: Cant load WSA library. Error code: %d
ru: Не могу загрузить библиотеку WSA. Код ошибки: %d

source: Invalid WSA version!
ru: Неверная версия WSA!

source: Cant create the debug socket. Error code: %d
ru: Не могу создать сокет отладчика. Код ошибки: %d

source: Cant connect to the debug socket. Error code: %d
ru: Не могу подключиться к сокет отладчика. Код ошибки: %d

source: Cant send to the debug socket. Error code: %d
ru: Не могу отправить в сокет отладчика. Код ошибки: %d

source: The debug socket error in select function!
ru: Ошибка сокета отладчика в выбраннной функции!

source: The debug socket error with input buffer!
ru: Ошибка сокета отладчика в буфере ввода!

source: Error. Close debug socket. Code: %d
ru: Ошибка. Закрыт сокет отладчика. Код: %d

source: Cant find lib with IID: %s
ru: Не могу найти библиотеку с IID: %s

source: Prevent program run by robot module: %s
ru: Работа программы предотвращена модулем робота: %s

source: Prevent program run by function module: %s
ru: Работа программы предотвращена модулем функций: %s

source: Prevent program run by control module: %s
ru: Работа программы предотвращена модулем управления: %s

source: Parameters not specified:
ru: Не задан параметр:

source: unknown parameters:
ru: Неизвестный параметр:

source: Robot module "%s" reported an error at the end of the program
ru: Модуль робота "%s" сообщил об ошибке во время завершения программы

source: Function module "%s" reported an error at the end of the program
ru: Модуль функций "%s" сообщил об ошибке во время завершения программы

source: Control module "%s" reported an error at the end of the program
ru: Модуль управления "%s" сообщил об ошибке во время завершения программы

source: Error occured during execute program: %s
ru: Во время выполнения программы произошла ошибка: %s

source: Invalid param: %s, specify name or value. Example: -P[argument_name]=[argument_value]
ru: Неверно задан параметр: %s, уточните его имя или значение. Пример: -P[Имя параметра]=[Значение параметра]

source: Example: [-version] rcml_interpreter test.rcml [params]
ru: Пример: [-version] rcml_interpreter test.rcml [параметры]

source: ***************Thank You for using RCC!**************
ru: ****************Спасибо за выбор RCC!***************

source: Thread Module Control %d (%p) started.
ru: Поток модуля управления %d (%p) начал работу.

source: Thread Module Control %d (%p) finished.
ru: Поток модуля управления %d (%p) завершил работу.

source: Thread Robot Control (%p) started.
ru: Поток управления роботом (%p) начал работу.

source: Thread Robot Control (%p) finished.
ru: Поток управления роботом (%p) завершил работу.

source: Cant init robot module(s)...
ru: Не могу инициализировать модуль(и) робота...

source: Cant init control module(s)...
ru: Не могу инициализировать модуль(и) управления...

source: Module Control (%d) finded SELF request.
ru: Модуль упрвления (%d) обнаружил SELF запрос.

source: Module Control (%d) finded robot %p.
ru: Модуль упрвления (%d) обнаружил робота %p.

source: Module Control (%d) havent free robots.
ru: Модуль упрвления (%d) не обнаружил свободных роботов.

source: Module Control (%d) finded FREE ROBOT request.
ru: Модуль упрвления (%d) обнаружил запрос на освобождение робота(FREE ROBOT).

source: Module Control (%d) start wait Robot Control Thread: %p.
ru: Модуль упрвления (%d) начал ожидание Потока Управления роботом: %p.

source: Robot Control %p (%s) added NEW function.
ru: Модуль Управления роботом %p (%s) добавил новую(NEW) функцию.

source: Robot Control %p added NEW function.
ru: Модуль Управления роботом %p добавил новую(NEW) функцию.

source: Unexpected command mode!
ru: Задан неверный режим команд!

source: Robot control %p working...
ru: Работает управление роботом %p...

source: Robot Control %p finded NEW request
ru: Модуль Управления роботом %p обнаружил запрос NEW.

source: Robot Control (%p) finded DELETE request.
ru: Модуль Управления роботом (%p) обнаружил запрос DELETE.

source: Unknow asm command %d.
ru: Неизвестная команда asm %d.

source: Unexpected wait flag value!
ru: Неверное значение флага ожидания!

source: Incompatible mode of execute for user function.
ru: Несовместимый режим исполнения для пользовательской функции.

source: stack size = %d
ru: размер стэка = %d

source: Unhandled exception!
ru: Необработанное исключение!

source: Unknow WaitFlag for default send_package!
ru: Неизвестный флаг ожидания для send_package!

source: Incompatible mode of execute for module function.
ru: Несовместимый режим исполнения для функции модуля.

source: Unknown module API version!
ru: Неизвестная версия API модуля!

source: Incompatible module API!
ru: несовместимое API модуля!

source: Can't load %s module: %s
ru: не могу загрузить %s модуля: %s

source: Can't find "%s" in module
ru: Не могу найти "%s" в модуле

source: IID "%s" already loaded!
ru: IID "%s" уже загружен!

source: Loaded %s module from: %s
ru: Загружен модуль %s из: %s

source: Mode: production
ru: Режим: production

source: Module version: unknow
ru: Версия модуля: неизвестна

source: Mode: %s
ru: Режим: %s

source: Module version: %d
ru: Версия модуля: %d

source: API version: %d
ru: Версия API: %d

source: In module by path: %s
ru: В модуле в каталоге: %s

source: Unknown api version!
ru: Неизвестная версия API!

source: Incompabilty API!
ru: Несовместимый API!

source: wrong command index in functions:
ru: неверный индекс команды в функции:

source: wrong axis index in axises:
ru: неверный индекс оси в осях:

source: Can't load module: %s
ru: Не могу загрузить модуль: %s

source: Unknown type of module: %s
ru: Неизвестен тип модуля: %s

source: Please restart interpreter. Don't forget enable "%s" module in config.ini!
ru: Пожалуйста перезапустите интерпретатор. Не забудьте включить модуль "%s" в config.ini!

source: Can't open pcode file: %s
ru: Не могу открыть файл псевдокода: %s

source: Can't load header!
ru: Не могу загрузить заголовок псевдокода!

source: Can't execute RCML lib!
ru: Не могу подключить(execute) библиотеку RCML!

source: Can't load RCML program as lib!
ru: Не могу загрузить RCML программу как библиотеку!

source: Can't find IID in the execute RCML file!
ru: Не могу найти IID в имсполняемом файле RCML!

source: Cant load pcode file: %s
ru: Не могу загрузить файл псевдокода: %s

source: PCode %d is not lib!
ru: Псевдокод(PCode) %d это не библиотека!

source: Start PCode (%d) map libs.
ru: Начато создание карты библиотек из псевдокода (%d) .

source: Cant find function: %s
ru: Не могу найти функцию: %s

source: This is not RCML pcode file!
ru: Это не файл псевдокода RCML!

source: Unknown PCode version
ru: Неизвестная версия псевдокода
